src/main/test/supply-chain/1-Grouping/0-Apply Tax/0-02_01_SUBCLASS-Grouping/5-TC02_01.06_LOGISTICS_header_line_level_different_values/2-TC02_01.06_LOGISTICS_header_line_level_different_values-3-CNEC/request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
	<soap:Header/>
	<soap:Body>
		<ws:applyTax>
			<arg0>
				<DocumentId>
					<SystemSourceId>ICI001</SystemSourceId>
					<TransactionId></TransactionId>
				</DocumentId>
				<AlternateDocumentId>
					<CustomField1>TEST</CustomField1>
					<CustomField2>INV</CustomField2>
					<CustomField3>req3</CustomField3>
					<CustomField4/>
					<CustomField5/>
					<CustomField6/>
					<CustomField7/>
					<CustomField8/>
					<CustomField9/>
					<CustomField10/>
				</AlternateDocumentId>
				<InvoiceLanguage>
					<LanguageCode/>
					<LanguageCountryCode/>
				</InvoiceLanguage>
				<CommunicationLanguage>
					<LanguageCode/>
					<LanguageCountryCode/>
				</CommunicationLanguage>
				<CalculationDecimalPlaces>5</CalculationDecimalPlaces>
				<PreviousInvoiceTaxCountry>DE</PreviousInvoiceTaxCountry>
				<TaxDecisionSet>
					<TaxDecisionSetId/>
					<SellerTaxIndicator>
						<TaxIndicatorAbbreviation/>
						<TaxIndicatorName/>
						<TaxIndicatorComment/>
					</SellerTaxIndicator>
					<SellerTaxCountry/>
					<SellerTaxState/>
					<BuyerTaxIndicator>
						<TaxIndicatorAbbreviation/>
						<TaxIndicatorName/>
						<TaxIndicatorComment/>
					</BuyerTaxIndicator>
					<BuyerTaxCountry/>
					<BuyerTaxState/>
					<CombinedTaxIndicator/>
					<CommercialIndicator/>
					<SellerTaxRegCountry/>
					<SellerTaxRegState/>
					<BuyerTaxRegCountry/>
					<BuyerTaxRegState/>
					<SellerTaxTotal>
						<NetAmount></NetAmount>
						<TaxAmount></TaxAmount>
						<GrossAmount></GrossAmount>
						<TaxAmountInLocalCurrency/>
						<TaxInvoiceSubTotal>
							<TaxType>
								<TaxTypeName/>
								<TaxTypeAbbreviation/>
								<TaxTypeDescription/>
							</TaxType>
							<TaxCode/>
							<TaxRate/>
							<NetAmount/>
							<TaxAmount/>
							<GrossAmount/>
							<TaxAmountInLocalCurrency/>
						</TaxInvoiceSubTotal>
					</SellerTaxTotal>
					<BuyerTaxTotal>
						<NetAmount/>
						<TaxAmount/>
						<GrossAmount/>
						<TaxAmountInLocalCurrency/>
						<TaxInvoiceSubTotal>
							<TaxType>
								<TaxTypeName/>
								<TaxTypeAbbreviation/>
								<TaxTypeDescription/>
							</TaxType>
							<TaxCode/>
							<TaxRate/>
							<NetAmount/>
							<TaxAmount/>
							<GrossAmount/>
							<TaxAmountInLocalCurrency/>
						</TaxInvoiceSubTotal>
					</BuyerTaxTotal>
					<TaxComment>
						<TaxCommentType/>
						<TaxCommentText/>
					</TaxComment>
					<InvoiceCurrency>
						<CurrencyCode>EUR</CurrencyCode>
						<SellerLocalTaxCurrencyExchangeRate/>
						<SellerLocalTaxCurrencyCode/>
						<BuyerLocalTaxCurrencyExchangeRate/>
						<BuyerLocalTaxCurrencyCode/>
					</InvoiceCurrency>
					<LegalTaxCalculationLevel/>
					<TaxInvoiceLine>
						<LineNumber>1</LineNumber>
						<ItemNo>987654</ItemNo>
						<ItemType></ItemType>
						<UNSPSC>30000000</UNSPSC>
						<Classification/>
						<SubClassification/>
						<CountryItemClassification/>
						<NetAmount>8.00</NetAmount>
						<VariableTaxSteeringInput>
							<ConsignorCountry></ConsignorCountry>
							<ConsignorState/>
							<ConsignorBusinessUnitCode/>
							<ConsignorBusinessUnitType/>
							<ConsigneeCountry>DE</ConsigneeCountry>
							<ConsigneeState></ConsigneeState>
							<ConsigneeBusinessUnitCode></ConsigneeBusinessUnitCode>
							<ConsigneeBusinessUnitType></ConsigneeBusinessUnitType>
							<CarrierCountry/>
							<CarrierState/>
							<CarrierBusinessUnitCode/>
							<CarrierBusinessUnitType/>
							<ShipmentStartCountry/>
							<ShipmentEndCountry/>
							<ShipmentStartState/>
							<ShipmentEndState/>
							<ServiceRenderedCountry/>
							<ServiceRenderedState/>
							<ResalePurpose/>
							<IsOutBonded/>
							<IsInBonded/>
							<TaxPreAlgorithmOutput>
								<IsExport/>
								<IsImport/>
								<IsExported/>
								<IsImported/>
							</TaxPreAlgorithmOutput>
							<ShippingOfCustomsClearedGoods/>
						</VariableTaxSteeringInput>
					</TaxInvoiceLine>
					<TaxInvoiceLine>
						<LineNumber>2</LineNumber>
						<ItemNo>123654789</ItemNo>
						<ItemType></ItemType>
						<UNSPSC>81141601</UNSPSC>
						<Classification/>
						<SubClassification/>
						<CountryItemClassification/>
						<NetAmount>10.00</NetAmount>
						<VariableTaxSteeringInput>
							<ConsignorCountry></ConsignorCountry>
							<ConsignorState/>
							<ConsignorBusinessUnitCode/>
							<ConsignorBusinessUnitType/>
							<ConsigneeCountry>IT</ConsigneeCountry>
							<ConsigneeState></ConsigneeState>
							<ConsigneeBusinessUnitCode></ConsigneeBusinessUnitCode>
							<ConsigneeBusinessUnitType></ConsigneeBusinessUnitType>
							<CarrierCountry/>
							<CarrierState/>
							<CarrierBusinessUnitCode/>
							<CarrierBusinessUnitType/>
							<ShipmentStartCountry/>
							<ShipmentEndCountry/>
							<ShipmentStartState/>
							<ShipmentEndState/>
							<ServiceRenderedCountry/>
							<ServiceRenderedState/>
							<ResalePurpose/>
							<IsOutBonded/>
							<IsInBonded/>
							<TaxPreAlgorithmOutput>
								<IsExport/>
								<IsImport/>
								<IsExported/>
								<IsImported/>
							</TaxPreAlgorithmOutput>
							<ShippingOfCustomsClearedGoods/>
						</VariableTaxSteeringInput>
					</TaxInvoiceLine>
				</TaxDecisionSet>
				<TaxDate>
					<TaxAlgorithmDate>2013-02-01</TaxAlgorithmDate>
					<TaxCalculationDate/>
				</TaxDate>
				<TaxModuleBehaviour>
					<SkipCalculation>Y</SkipCalculation>
					<SkipDecision>N</SkipDecision>
				</TaxModuleBehaviour>
				<VariableTaxSteeringInput>
					<ConsignorCountry></ConsignorCountry>
					<ConsignorState/>
					<ConsignorBusinessUnitCode>22416</ConsignorBusinessUnitCode>
					<ConsignorBusinessUnitType>SUP</ConsignorBusinessUnitType>
					<ConsigneeCountry/>
					<ConsigneeState/>
					<ConsigneeBusinessUnitCode>278</ConsigneeBusinessUnitCode>
					<ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
					<CarrierCountry/>
					<CarrierState/>
					<CarrierBusinessUnitCode>38272</CarrierBusinessUnitCode>
					<CarrierBusinessUnitType>CAR</CarrierBusinessUnitType>
					<ShipmentStartCountry>CZ</ShipmentStartCountry>
					<ShipmentEndCountry>CZ</ShipmentEndCountry>
					<ShipmentStartState/>
					<ShipmentEndState/>
					<ServiceRenderedCountry/>
					<ServiceRenderedState/>
					<ResalePurpose></ResalePurpose>
					<IsOutBonded></IsOutBonded>
					<IsInBonded></IsInBonded>
					<TaxPreAlgorithmOutput>
						<IsExport></IsExport>
						<IsImport></IsImport>
						<IsExported></IsExported>
						<IsImported></IsImported>
					</TaxPreAlgorithmOutput>
					<ShippingOfCustomsClearedGoods>Y</ShippingOfCustomsClearedGoods>
				</VariableTaxSteeringInput>
				<BuyerParty>
					<Party>
						<BusinessUnitCode>5430</BusinessUnitCode>
						<BusinessUnitType>COM</BusinessUnitType>
						<BusinessUnitName/>
						<PartyAddress>
							<AddressType/>
							<City/>
							<PostBox/>
							<Street/>
							<ZipCode/>
							<CountryCode/>
							<StateCode/>
							<CountryOfLegalRegistration/>
						</PartyAddress>
					</Party>
				</BuyerParty>
				<SellerParty>
					<Party>
						<BusinessUnitCode>5100</BusinessUnitCode>
						<BusinessUnitType>COM</BusinessUnitType>
						<BusinessUnitName/>
						<PartyAddress>
							<AddressType/>
							<City/>
							<PostBox/>
							<Street/>
							<ZipCode/>
							<CountryCode/>
							<StateCode/>
							<CountryOfLegalRegistration/>
						</PartyAddress>
					</Party>
				</SellerParty>
				<TermOfDelivery/>
			</arg0>
		</ws:applyTax>
	</soap:Body>
</soap:Envelope>
